package solution.sergei;

/*
1. Создать рекурсивный меод, которая будет вычислять факториал числа.

2. Создать метод, который будет находить минимальный и максимальный элемент массива дробных чисел (double[]),
печатать их в консоль и возвращать среднее значение между максимальным и минимальным числом.

3. Создать метод который будет преобразовавать одномерный целочисленный массив в двухмерный.
Преобразование долно происходить по следующему закону:
 - на выходе получается двумерный массив 2-х срок равной длины (входной массив четной длины) или во втором ряду(массиве) на 1 эелемент меньше,
 если входной массив нечетной длины.
 - 1-й массив содержит четные элементы входного, 2-й  -  нечетные
 к примеру:
 входной                           выходной
 new int[] {1, 2, 3, 4}            new int[][] {new int[]{1,3}, new int[]{2, 4}}
 new int[] {1, 2, 3}               new int[][] {new int[]{1,3}, new int[]{2}}
*/

public class Task2_additional {

    public static void main (){

    }

}
