package session.forothersessions.collections;

public class MainCollections {
    /*
    Коллекции - это хранилища(контейнеры) поддерживающие различные способы накопления и упорядочения объектов

    В Collection Framework входят коллекции(Collection) и Отображения(Map) см. collect.jpg
        Основные интерфейсы коллекций:
    - Collection - вершина иерархии коллекций
        - List - управление списками
        - Set - управление множествами
            - SortedSet - управление отсортированными множествами
                - NavigableSet - для извлечения элементов по результатам поиска
        - Queue - управление специализированными типами списков, где элементы удаляются только из начала списка
            - Deque - организация двухсторонней очереди


     */
    public static void main(String[] args) {
    }
}
