package solution.andrei;

//1. Создать метод, который выводит в консоль переданный double в формате "два символа после запятой"(использовать форматирование строки)

public class Task3 {
    public static void main(String[] args){
        double number =3.466;
        System.out.printf( "%.2f",deduces(number));
        System.out.println( );
        System.out.println( );
    }
    public static double deduces(double a) {
     return a;
    }
}
